[orchid_vo_chapter8_0010_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="It's time to assemble the compass and find out where Captain Blade buried his treasure. Here.",Time=0)

[orchid_vo_chapter8_0020_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="This is my piece of the compass. Take it.",Time=0)

[orchid_vo_chapter8_0030_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="Now, combine it with the other three pieces of the compass you've collected on that table over there.",Time=0)

[orchid_vo_chapter8_0040_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="There it is: the Compass of the Sands. Please, grab it.",Time=0)

[orchid_vo_chapter8_0050_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="And now, we've treasure to find. Take the compass to Magnys Lighthouse.",Time=0)

[orchid_vo_chapter8_0060_echox_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="Captain Blade built the Magnys Lighthouse a few years before he died. His notes say that if you take the compass to the top of the lighthouse, it'll show you exactly where the treasure is buried. Of course, Blade's notes also had a lot to say about society being secretly run by sentient tacos. He kind of went off the rails there, near the end.",Time=0)

[orchid_vo_chapter8_0070_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="You want to get to the top of the rock spire, fight your way to the top of lightouse, then use the compass while you're up there. Then we'll find out where the treasure is buried, and probably try to race one another to reach it first. It'll be fun!",Time=0)

[orchid_vo_chapter8_0080_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="If you reach the treasure before me -- which you won't, of course, but just in case -- be careful of the Leviathan. It ate Roscoe, as I may have already mentioned, and Blade's notes say it will die to protect the treasure chamber.",Time=0)

[orchid_vo_chapter8_0090_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="Hurry to the top of the lighthouse -- the Leviathan knows how close we are to finding the treasure, and he sounds rather miffed. Pretty awesome, right?",Time=0)

[orchid_vo_chapter8_0100_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="You're at the top of the lighthouse? Lovely! Just find somewhere to place Blade's compass, and we'll find out exactly where the treasure is buried.",Time=0)

[orchid_vo_chapter8_0110_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="Is it working? What's happening?",Time=0)

[orchid_vo_chapter8_0120_echo_scarlett]
bManualWordWrap=False
bMature=False
Subtitles[0]=(Text="You did it! It looks like the treasure's buried in Wurmwater, ha-ha! I'll meet you out there!",Time=0)
